<a href="https://colab.research.google.com/github/sahilmerai/ml_basic/blob/master/linear_regression/placement_data_linear.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd
import numpy as np

data = pd.read_csv("placement.csv")

In [2]:
data.head()

   sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
0      1      M  67.00   Others  ...          Mkt&HR  58.80      Placed  270000.0
1      2      M  79.33  Central  ...         Mkt&Fin  66.28      Placed  200000.0
2      3      M  65.00  Central  ...         Mkt&Fin  57.80      Placed  250000.0
3      4      M  56.00  Central  ...          Mkt&HR  59.43  Not Placed       NaN
4      5      M  85.80  Central  ...         Mkt&Fin  55.50      Placed  425000.0

[5 rows x 15 columns]

In [3]:
## Data cleaning

In [4]:
import math
median_salary = math.floor(data.salary.median())
median_salary

265000

In [5]:
data.salary = data.salary.fillna(median_salary)
data.head()

   sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
0      1      M  67.00   Others  ...          Mkt&HR  58.80      Placed  270000.0
1      2      M  79.33  Central  ...         Mkt&Fin  66.28      Placed  200000.0
2      3      M  65.00  Central  ...         Mkt&Fin  57.80      Placed  250000.0
3      4      M  56.00  Central  ...          Mkt&HR  59.43  Not Placed  265000.0
4      5      M  85.80  Central  ...         Mkt&Fin  55.50      Placed  425000.0

[5 rows x 15 columns]

In [6]:
gender = pd.get_dummies(data["gender"], drop_first=True )
gender.head()

   M
0  1
1  1
2  1
3  1
4  1

In [7]:
work = pd.get_dummies(data["workex"] , drop_first=True ) 
work.head()

   Yes
0    0
1    1
2    0
3    0
4    0

In [8]:
specialisation = pd.get_dummies(data["specialisation"] , drop_first=True )
specialisation.head()

   Mkt&HR
0       1
1       0
2       0
3       1
4       0

In [9]:
status = pd.get_dummies(data["status"] , drop_first=True)
status.head()

   Placed
0       1
1       1
2       1
3       0
4       1

In [10]:
degree = pd.get_dummies(data["degree_t"] , drop_first=True )
degree.head()

   Others  Sci&Tech
0       0         1
1       0         1
2       0         0
3       0         1
4       0         0

In [11]:
data = pd.concat([data , gender , work, degree , specialisation , status ], axis=1 )

In [12]:
data.head()

   sl_no gender  ssc_p    ssc_b  hsc_p  ... Yes Others  Sci&Tech Mkt&HR Placed
0      1      M  67.00   Others  91.00  ...   0      0         1      1      1
1      2      M  79.33  Central  78.33  ...   1      0         1      0      1
2      3      M  65.00  Central  68.00  ...   0      0         0      0      1
3      4      M  56.00  Central  52.00  ...   0      0         1      1      0
4      5      M  85.80  Central  73.60  ...   0      0         0      0      1

[5 rows x 21 columns]

In [13]:
data.drop(["sl_no","gender","ssc_p","ssc_b","hsc_p","hsc_b","hsc_s","degree_t","workex","specialisation","status"] , axis=1 , inplace=True)

In [14]:
data.head()

   degree_p  etest_p  mba_p    salary  M  Yes  Others  Sci&Tech  Mkt&HR  Placed
0     58.00     55.0  58.80  270000.0  1    0       0         1       1       1
1     77.48     86.5  66.28  200000.0  1    1       0         1       0       1
2     64.00     75.0  57.80  250000.0  1    0       0         0       0       1
3     52.00     66.0  59.43  265000.0  1    0       0         1       1       0
4     73.30     96.8  55.50  425000.0  1    0       0         0       0       1

In [17]:
from sklearn.linear_model import LinearRegression

In [18]:
lr = LinearRegression()

In [22]:
lr.fit(data[["degree_p","etest_p","mba_p","M","Yes","Others","Sci&Tech","Mkt&HR","Placed"]],data.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [24]:
lr.coef_

array([ -1220.29968888,    624.59548094,   2331.81308741,  21106.21595122,
        10179.81010835,   2795.95165402,  21495.36168894, -13546.40246176,
        19881.1136372 ])

In [25]:
lr.intercept_

141129.54365027597

In [29]:
lr.predict([[75,95,65,1,0,0,0,0,1]])

array([301498.81794322])